[
  {
    "id": "001",
    "slug": "technology-by-design",
    "company": "Technology By Design",
    "personName": "Chad Carlson",

    "mainBody": "Chad, I want to thank you for taking the time to check this out. These are just a few ideas I put together to highlight the kind of work I’ve been focused on and how it might support what you’re doing at Technology by Design.<br/><br/> None of this is meant to be a pitch with pressure... just a tailored glimpse at how I could potentially contribute. If any of these ideas spark something, I’d love to talk more. And if you know of another direction or even someone else who might benefit from this kind of work, I’m genuinely open to any conversation. Appreciate the time and the work you do.",
    "ideas": [
      {
        "title": "Custom Display Tools for FileMaker",
        "subtitle": "Visual interfaces built on the FileMaker Data API",
        "body": "Technology by Design provides excellent support and consulting, but many of your clients may be missing an opportunity to make their FileMaker data more accessible through user-friendly web interfaces. I've already worked with Scott on a tool called 'TestDrive'. A web application that connects directly to a FileMaker layout using the Data API. Together, we could turn this concept into a customizable framework for your clients. Imagine clean, responsive dashboards that pull live data from FileMaker. Accessible via secure login, styled to match each client’s brand, and deployable without disrupting their core systems. You bring the strategy; I’ll build the interface.",
        "image": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/test-drive.webp",
        "imageAlt": "FileMaker Data API dashboard concept",
        "urlImage": "https://main.d283ike1beb7cu.amplifyapp.com/"
      },
      {
        "title": "Explainer Videos for Tech Strategy",
        "subtitle": "Visual content for onboarding, internal tools, or client education",
        "body": "As a former media producer turned developer, I offer a unique mix of storytelling and technical know-how. One area I think could benefit Technology by Design is video. Whether it's onboarding walkthroughs for client-facing tools, animated breakdowns of your consulting process, or internal explainers for new systems. This type of content builds trust, reinforces your thoughtful approach, and helps users better understand the tools you’re putting in place. With years of experience in motion graphics, video editing, and scripting, I can translate complex ideas into clear, engaging visuals tailored to your voice and audience.  <br/><br/> Check out my <a href='https://nicholasegner.com/video-experience'>Video Experience</a> as a proof of concept of how interactive video can be engaging: <a href='https://nicholasegner.com/video-experience'>CLICK HERE</a>",
        "image": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/video-experience.webp",
        "imageAlt": "Tech explainer video",
        "urlImage": "https://nicholasegner.com/video-experience"
      },
      {
        "title": "Branded Dashboards for Clients",
        "subtitle": "Custom, client-facing portals for project updates, file sharing, and communication",
        "body": "Imagine offering each of your clients a secure, branded dashboard. A single, professional interface where they can view project updates, download shared files, track key milestones, or request support. These lightweight web apps are custom-built to reflect each client’s brand and can evolve with their needs. I’d love to build a starter framework for Technology by Design to roll these out as a value-add for select clients. With your backend support and my frontend experience, we can create something that enhances transparency, boosts engagement, and reinforces the strategic partnership you bring to every relationship.",
        "image": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/branded-dashboard.webp",
        "imageAlt": "Branded client dashboard",
        "urlImage": ""
      }
    ]
  },
  {
    "id": "002",
    "slug": "scout-solutions",
    "company": "Scout Solutions",
    "personName": "Kevin May",

    "mainBody": "Kevin, thanks for taking the time to check this out, I really appreciate it. I know you have far more experience and perspective in this space than I do, and I’m genuinely looking to learn from people like you.<br/><br/>These are just a few ideas I put together to show the kind of work I’ve been focused on lately and how it might fit alongside what you’re doing at Scout Solutions. None of this is meant to be a hard pitch... more a conversation starter and a way to show where my skills might add value.<br/><br/>If any of these spark ideas, I’d love to hear your thoughts. And if you see another direction entirely or know someone else who might benefit from this kind of work, I am  all ears. I truly value your time and the work you do.",
    "ideas": [
      {
        "title": "Revitalize the Blog & Case Studies",
        "subtitle": "Fresh, relevant content to re-engage audiences",
        "body": "Scout’s blog has been quiet since December 2023. Might be a great opportunity to reintroduce consistent articles, client success stories, and service spotlights. Pairing written posts with visuals and short videos could help boost engagement, support digital marketing goals, easy social media posts, and position Scout as a thought leader in IT solutions.",
        "image": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/scout-blog.png",
        "imageAlt": "Blog content strategy concept",
        "urlImage": "https://scoutsolutions.com/blog/"
      },
      {
        "title": "Service Explainer Videos",
        "subtitle": "Clear, approachable video content",
        "body": "IT topics like cloud migration and cybersecurity can feel abstract for decision‑makers. Clear, concise explainer videos can bridge that gap. Simple to understand, simple to share, and ideal for the site, social, and sales conversations. Here’s a quick proof‑of‑concept I’m iterating on: <a style='color: lightblue;' href='https://nicholasegner.com/video-experience'>Interactive Video Experience PLAY</a>. <br/><small>(Mobile polish coming.)</small>",
        "image": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/video-experience.webp",
        "imageAlt": "Video marketing concept",
        "urlImage": "https://nicholasegner.com/video-experience"
      },
      {
        "title": "Custom Interactive Tools",
        "subtitle": "Branded, user-friendly data experiences",
        "body": "Since Scout uses Power BI, there’s an opportunity to deliver dashboards and data tools that look and feel truly unique. Using React-based design (like my work at Barlow), I can make data visualization more intuitive, branded, and client-friendly, hopefully standing out from standard templates. I cloned a tool I made for Barlow called TestDrive, Link: <a style='color: lightblue;' href='https://main.d283ike1beb7cu.amplifyapp.com/'> CLICK HERE</a>",
        "image": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/branded-dashboard.webp",
        "imageAlt": "Custom data dashboard concept",
        "urlImage": "https://main.d283ike1beb7cu.amplifyapp.com/"
      }
    ]
  },
  {
    "id": "003",
    "slug": "bellmont-partners",
    "company": "Bellmont Partners",
    "personName": "Kathleen Hennessy",
    "linkImage": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/projects/bellmont-cover-image.png",
    "mainBody": "Hi Kathleen, <br/><br/>It was great seeing you and catching up! I really appreciated the chance to reconnect and hear more about what you and Bellmont Partners has been up to. I put this page together as a quick way to share some of my recent work and ideas that might align with what you and your team are doing. <br/><br/> Thanks again for taking the time, and I hope we can collaborate!",
    "ideas": [
      {
        "title": "Interactive Dashboards & Data Storytelling",
        "subtitle": "Turning complex information into engaging, branded experiences",
        "body": "Interactive dashboards can add depth to client reporting and storytelling. Instead of static presentations, these tools transform campaign data into dynamic, on-brand visuals, making it easier to showcase results and insights in real time. Built with React, these dashboards can be fully customized to reflect you or your client’s brand.<br><br>I’ve included a demo where I built a custom client-facing dashboard.  TestDrive.<br><br> <a style='color: lightblue;' href='https://main.d283ike1beb7cu.amplifyapp.com/' target='_blank'>View the example here.</a>",
        "image": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/branded-dashboard.webp",
        "imageAlt": "Custom interactive data dashboard example",
        "urlImage": "https://main.d283ike1beb7cu.amplifyapp.com/"
      },
      {
        "title": "Service Explainer & Campaign Videos",
        "subtitle": "Bringing stories to life through approachable, on-brand video",
        "body": "Short, clear explainer videos can make messages even more accessible across web, social, and presentations. Whether clarifying complex topics or showcasing success stories, these pieces blend narrative, design, and interactivity to enhance audience understanding and engagement.<br><br>Here’s a proof-of-concept of an interactive video format I’ve been developing:<br><br> <a style='color: lightblue;' href='https://nicholasegner.com/video-experience' target='_blank'>View Interactive Video Experience</a>.<br/><small>(Optimized mobile version in progress.)</small>",
        "image": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/video-experience.webp",
        "imageAlt": "Interactive explainer video concept",
        "urlImage": "https://nicholasegner.com/video-experience"
      },
      {
        "title": "Event & Conference Highlight Videos",
        "subtitle": "Capturing moments that extend a brand’s story",
        "body": "From conferences to panel discussions, event highlight videos help transform live experiences into ongoing storytelling assets. They’re ideal for post-event engagement, social sharing, and reinforcing thought leadership long after the event ends.<br><br>This edit showcases my approach to blending narrative pacing, branded motion graphics, and clear messaging for professional audiences.<br><br><a style='color: lightblue;' href='https://nciholasegner.s3.us-east-2.amazonaws.com/video/website-videos/bbc.mp4' target='_blank'>Watch Conference Edit 1</a><br><a style='color: lightblue;' href='https://nciholasegner.s3.us-east-2.amazonaws.com/video/website-videos/BBC_2024-2.mp4' target='_blank'>Watch Conference Edit 2</a><br><a style='color: lightblue;' href='https://nciholasegner.s3.us-east-2.amazonaws.com/video/website-videos/tap-to-pay.mp4' target='_blank'>Watch Tap-To-Pay</a>",
        "image": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/projects/BBC-2024.webp",
        "imageAlt": "Conference video highlight",
        "urlImage": "https://nciholasegner.s3.us-east-2.amazonaws.com/video/website-videos/bbc.mp4"
      },
      {
        "title": "Video Links",
        "subtitle": "Links to videos I produced throughout my career",
        "body": "A sampling of video work spanning storytelling, branded collaborations, and motion design. Each piece reflects a slightly different approach. From community-focused documentary to corporate storytelling and creative editing.<br><br><a style='color: lightblue;' href='https://nciholasegner.s3.us-east-2.amazonaws.com/video/website-videos/whittier.mp4' target='_blank'>Watch: Neighborhood Documentary</a><br><a style='color: lightblue;' href='https://nciholasegner.s3.us-east-2.amazonaws.com/video/website-videos/Landscape.mp4' target='_blank'>Watch: Landscape Structures Collaboration</a><br><a style='color: lightblue;' href='https://nciholasegner.s3.us-east-2.amazonaws.com/video/website-videos/demo.mp4' target='_blank'>Watch: Demo Reel</a>",
        "image": "https://nciholasegner.s3.us-east-2.amazonaws.com/images/video-examples.webp",
        "imageAlt": "Conference video highlight",
        "urlImage": "https://nciholasegner.s3.us-east-2.amazonaws.com/video/website-videos/bbc.mp4"
      }
    ]
  }
]
