[
  {
    "name": "Eric Stober",
    "image": "https://lh3.googleusercontent.com/a-/ALV-UjUtZlXJ7srcmYG3YfjO3wwtlRj2qJhQp7ZzNFBr33pbFpsdpDfL=w72-h72-p-rp-mo-br100",
    "text": "Nick is an exceptional web developer based in Minneapolis. I've had the pleasure of working directly with him for over four years and have consistently been impressed by his broad skill set and dedication. Nick brings expertise in web design, development, and SEO best practices—and even extends into video production. His strong work ethic and relentless drive to keep learning make him a standout web developer. I highly recommend him to anyone looking for a talented and reliable partner for their digital projects."
  },
  {
    "name": "Andrea Moore",
    "image": "https://lh3.googleusercontent.com/a/ACg8ocKRcYMTe7TxXHmh4Msf8Z1STa82qtCpZ6RmyrnKkC6QdIVKuA=w72-h72-p-rp-mo-br100",
    "text": "Nicholas Egner, Web Developer based out of the Minneapolis area, has been my go to for all things considered creative development.  From web design and SEO projects, to video production and advertising, Nick's 'can do' attitude and drive to deliver quality work makes him a top choice in the space."
  },
  {
    "name": "John Barlow",
    "image": "https://lh3.googleusercontent.com/a-/ALV-UjWrI1COF5LV_kmICqdgLkm33szepauVXdockOmAz0bQrpDgZ3Y=w72-h72-p-rp-mo-br100",
    "text": "For the last five years, Nick has been our go-to for everything digital, from the website to integrating our database to email invites to live webcasts and podcasts.  He gets it done."
  },
  {
    "name": "Natasha Turanov, PMP",
    "image": "https://lh3.googleusercontent.com/a-/ALV-UjUCKws8DZw5VAHC1hlAvXXBV2XRowWURBmnb7BtLw91q6dPKdU=w72-h72-p-rp-mo-br100",
    "text": "I have worked with Nicholas Egner closely on a new web page design. He is a true professional! Always looking for creative new ideas how to implement a new feature quickly and efficiently. Always thinking outside of the box and providing consultation and expertise on the best delivery and presentation of the digital materials. Give Nick a call and he will be your true partner in any digital content design and development!"
  },
  {
    "name": "Rachel Ness",
    "image": "https://lh3.googleusercontent.com/a/ACg8ocLAJ5piPUbiYAwqEukGea76Lynge639XzCH9xQSyrqSKtt7Oas=w72-h72-p-rp-mo-br100",
    "text": "If you’re looking for a web developer In Minneapolis look no further than Nicholas Egner. He is always quick to respond. And would go above and beyond for any request I had."
  }
]
